Repository: sbrunner/jsonschema2md
Catalog: jsonschema2md/locales/*/LC_MESSAGES/messages.po
Languages: fr_ch, pt

source: Items
fr_ch: Éléments
pt: Itens

source: Contains
fr_ch: Contient
pt: Contém

source: Definitions
fr_ch: Définitions
pt: Definições

source: array
fr_ch: tableau
pt: lista

source: boolean
fr_ch: booléen
pt: booleano

source: null
pt: nulo

source: integer
fr_ch: entier
pt: inteiro

source: number
fr_ch: nombre
pt: número

source: object
fr_ch: objet
pt: objeto

source: Must be of type *%(type)s*.
fr_ch: Doit être de type *%(type)s*.
pt: Deve ser do tipo *%(type)s*.

source: Content encoding: `%(encoding)s`.
pt: Codificação do conteúdo: `%(encoding)s`.

source: Content media type: `%(type)s`.
fr_ch: Type de média du contenu: `%(type)s`.
pt: Tipo de mídia do conteúdo: `%(type)s`.

source: Minimum: `%(min)d`.
pt: Mínimo: `%(min)d`.

source: Exclusive minimum: `%(exmin)d`.
fr_ch: Minimum exclusif: `%(exmin)d`.
pt: Mínimo exclusivo: `%(exmin)d`.

source: Maximum: `%(max)d`.
pt: Máximo: `%(max)d`.

source: Exclusive maximum: `%(exmax)d`.
fr_ch: Maximum exclusif: `%(exmax)d`.
pt: Máximo exclusivo: `%(exmax)d`.

source: Length must be at least %(min)d.
fr_ch: La longueur doit être d'au moins %(min)d.
pt: Comprimento deve ser pelo menos %(min)d.

source: Length must be at most %(max)d.
fr_ch: La longueur doit être au maximum de %(max)d.
pt: Comprimento deve ser no máximo %(max)d.

source: Length must be equal to %(length)d.
fr_ch: La longueur doit être égale à %(length)d.
pt: Comprimento deve ser igual a %(length)d.

source: Length must be between %(min)d and %(max)d (inclusive).
fr_ch: La longueur doit être comprise entre %(min)d et %(max)d (inclus).
pt: Comprimento deve estar entre %(min)d e %(max)d (inclusivo).

source: Must be an integer.
fr_ch: Doit être un entier.
pt: Deve ser um inteiro.

source: Must be a multiple of `%(multiple)d`.
fr_ch: Doit être un multiple de `%(multiple)d`.
pt: Deve ser um múltiplo de `%(multiple)d`.

source: Must match pattern: `%(pattern)s` ([Test](%(link)s)).
fr_ch: Doit correspondre au modèle: `%(pattern)s` ([Test](%(link)s)).
pt: Deve corresponder ao padrão: `%(pattern)s` ([Testar](%(link)s)).

source: Items must be unique.
fr_ch: Les éléments doivent être uniques.
pt: Os itens devem ser únicos.

source: Contains schema must be matched at least %(min)d times.
fr_ch: Le schéma « contains » doit correspondre au moins %(min)d fois.
pt: O esquema "contains" deve corresponder pelo menos %(min)d vezes.

source: Contains schema must be matched at most %(max)d times.
fr_ch: Le schéma « contains » doit correspondre au maximum %(max)d fois.
pt: O esquema "contains" deve corresponder no máximo %(max)d vezes.

source: Contains schema must be matched exactly %(count)d times.
fr_ch: Le schéma « contains » doit correspondre exactement %(count)d fois.
pt: O esquema "contains" deve corresponder exatamente %(count)d vezes.

source: Contains schema must be matched between %(min)d and %(max)d times (inclusive).
fr_ch: Le schéma « contains » doit correspondre entre %(min)d et %(max)d fois (inclus).
pt: O esquema "contains" deve corresponder entre %(min)d e %(max)d vezes (inclusivo).

source: Number of properties must be at least %(min)d.
fr_ch: Le nombre de propriétés doit être d'au moins %(min)d.
pt: O número de propriedades deve ser pelo menos %(min)d.

source: Number of properties must be at most %(max)d.
fr_ch: Le nombre de propriétés doit être au maximum de %(max)d.
pt: O número de propriedades deve ser no máximo %(max)d.

source: Number of properties must be equal to %(count)d.
fr_ch: Le nombre de propriétés doit être égal à %(count)d.
pt: O número de propriedades deve ser igual a %(count)d.

source: Number of properties must be between %(min)d and %(max)d (inclusive).
fr_ch: Le nombre de propriétés doit être entre %(min)d et %(max)d (inclus).
pt: O número de propriedades deve estar entre %(min)d e %(max)d (inclusivo).

source: Must be one of: %(enum)s.
fr_ch: Doit être l'un des suivants: %(enum)s.
pt: Deve ser um de: %(enum)s.

source: Must be: `%(const)s`.
fr_ch: Doit être: `%(const)s`.
pt: Deve ser: `%(const)s`.

source: Can contain additional properties.
fr_ch: Peut contenir des propriétés supplémentaires.
pt: Pode conter propriedades adicionais.

source: Cannot contain additional properties.
fr_ch: Ne peut pas contenir des propriétés supplémentaires.
pt: Não pode conter propriedades adicionais.

source: Can contain unevaluated properties.
fr_ch: Peut contenir des propriétés non évaluées.
pt: Pode conter propriedades não correspondidas.

source: Cannot contain unevaluated properties.
fr_ch: Ne peut pas contenir des propriétés non évaluées.
pt: Não pode conter propriedades não correspondidas.

source: Refer to *[%(ref)s](#%(ref_link)s)*.
fr_ch: Se référer à *[%(ref)s](#%(ref_link)s)*.
pt: Consulte *[%(ref)s](#%(ref_link)s)*.

source: Default: `%(default)s`.
fr_ch: Par défaut: `%(default)s`.
pt: Padrão: `%(default)s`.

source: Examples:
fr_ch: Exemples:
pt: Exemplos:

source: , format: %(format)s
pt: , formato: %(format)s

source: required
fr_ch: obligatoire
pt: obrigatório

source: required <sub><sup>if %(dependent)s is set</sup></sub>
fr_ch: obligatoire <sub><sup>si %(dependent)s est défini</sup></sub>
pt: obrigatório <sub><sup>se %(dependent)s está definido</sup></sub>

source: deprecated
fr_ch: déprécié
pt: obsoleto

source: read-only
fr_ch: lecture seule
pt: somente-leitura

source: write-only
fr_ch: écriture seule
pt: somente-escrita

source: All of
fr_ch: Tous les
pt: Todos de

source: Any of
fr_ch: Un des
pt: Qualquer de

source: One of
fr_ch: L'un de
pt: Um de

source: Additional properties
fr_ch: Propriétés supplémentaires
pt: Propriedades adicionais

source: Unevaluated properties
fr_ch: Propriétés non évaluées
pt: Propriedades não correspondidas

source: JSON Schema
pt: Esquema JSON

source: Pattern Properties
fr_ch: Propriétés supplémentaires
pt: Propriedades de Padrão

source: Properties
fr_ch: Propriétés
pt: Propriedades

source: Examples
fr_ch: Exemples
pt: Exemplos

source: string
fr_ch: chaîne de caractères
